<a href="https://colab.research.google.com/github/Tanu-N-Prabhu/Python/blob/master/University_of_Regina_Professor's_salary.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Playing with the University of Regina Professor's salary using python (Data Science).

**The dataset for this tutorial can be found here [University of Regina](https://www.uregina.ca/orp/assets/statistics/2018-07-11-employees-earning-100K-plus.pdf). Just download this pdf and convert this to excel with comma separated  values (.CSV). To do this just go to youtube you'll find some great tutorials out there.**

![alt text](http://i63.tinypic.com/i1b82b.jpg)

In [4]:
from google.colab import files
uploaded = files.upload()

Saving UofR.csv to UofR.csv



---

In [0]:
import pandas as pd
import numpy as np
import io



---

In [0]:
df2 = pd.read_csv(io.BytesIO(uploaded['UofR.csv']))
# Dataset is now stored in a Pandas Dataframe



---

In [7]:
df2.head()

     Last Name First Name  ... Market\nSupplement       Total
0      Bredohl     Thomas  ...                NaN  135,110.00
1      Brigham    R. Mark  ...                NaN  174,973.00
2       Britto      Sarah  ...                NaN  137,442.00
3  Brotheridge       Neil  ...                NaN  164,260.00
4        Brown    Douglas  ...                NaN  124,952.00

[5 rows x 6 columns]



---

In [0]:
df2 = df2.replace(np.NaN, 0)

In [15]:
df2.head(10)

     Last Name First Name  ... Market\nSupplement       Total
0      Bredohl     Thomas  ...                  0  135,110.00
1      Brigham    R. Mark  ...                  0  174,973.00
2       Britto      Sarah  ...                  0  137,442.00
3  Brotheridge       Neil  ...                  0  164,260.00
4        Brown    Douglas  ...                  0  124,952.00
5        Brown     Janine  ...          11,180.00  108,004.00
6        Bruno       Paul  ...                  0  109,851.00
7      Buehler       Alex  ...                  0  109,761.00
8      Bundock      Chris  ...                  0  106,571.00
9   Burlingham       Clay  ...                  0  106,571.00

[10 rows x 6 columns]



---

**Thanks to StackOverflow for helping me with the capatilize() - which capitalizes the first letter of the word in whichever format you write, whereas the str.contain() - is used to match the string that we are looking for. So this acts as a search engine, wherein you can search for the name of the prof that you want and you'll get your answer. Make sure that you enter the first name of the professor that you are looking for.**

In [16]:
name = input("Enter the first name of the prof that you want to search")
name = name.capitalize()

df2[df2['First Name'].str.contains(name)]

Enter the first name of the prof that you want to searchCortney

   Last Name First Name  ... Market\nSupplement       Total
14      Butz    Cortney  ...                  0  174,008.00

[1 rows x 6 columns]



---